CSI API ETABS v1
cCaseHyperStatic.SetBaseCase Method
 Sets the base case for the specified hyperstatic load case
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetBaseCase(
	string Name,
	string HyperStaticCase
)
Function SetBaseCase (
	Name As String,
	HyperStaticCase As String
) As Integer
Dim instance As cCaseHyperStatic
Dim Name As String
Dim HyperStaticCase As String
Dim returnValue As Integer
returnValue = instance.SetBaseCase(Name,
	HyperStaticCase)
int SetBaseCase(
	String^ Name,
	String^ HyperStaticCase
)
abstract SetBaseCase :
        Name : string *
        HyperStaticCase : string -> int
Parameters
Name
Type: System.String
 The name of an existing hyperstatic load case
HyperStaticCase
Type: System.String
 The name of an existing static linear load case that is the base case for the specified hyperstatic load case
Return Value
Type: Int32
 Returns zero if the base case is successfully set; otherwise it returns a nonzero value
Remarks
See Also
Reference
cCaseHyperStatic Interface
ETABSv1 Namespace